// JavaScript Document
var j=0;pArr=new Array(); 
pArr[j++]=new Array("a","阿","啊","吖","嗄","锕","安","爱","暗","案","按");
pArr[j++]=new Array("ai","爱","呆","挨","哀","埃","碍","艾","唉","矮","哎","癌","嗌","嗳","嗳","嫒","捱","暧","瑷","皑","砹","硙","蔼","诶","锿","隘","霭");
pArr[j++]=new Array("an","安","暗","案","按","岸","俺","埯","庵","揞","桉","氨","犴","胺","腌","谙","铵","鞍","鹌","黯");
pArr[j++]=new Array("ang","昂","盎","腌");
pArr[j++]=new Array("ao","奥","澳","傲","熬","凹","嗷","坳","媪","岙","廒","懊","拗","敖","燠","獒","翱","聱","螯","袄","遨","鏊","鏖","骜","鳌");
pArr[j++]=new Array("b","不","本","把","部","便","被","北","并","别","比");
pArr[j++]=new Array("ba","把","八","吧","巴","伯","罢","爸","拔","霸","坝","叭","扒","岜","捌","杷","湃","灞","疤","笆","粑","耙","芭","茇","菝","萆","跋","钯","钹","靶","魃","鲃","鲅","鲌");
pArr[j++]=new Array("bai","白","百","伯","败","拜","摆","柏","佰","呗","捭","掰","稗","薜","鞴");
pArr[j++]=new Array("ban","反","办","半","版","般","班","板","伴","搬","扮","斑","颁","坂","扳","拌","瓣","瘢","癍","绊","舨","钣","阪");
pArr[j++]=new Array("bang","帮","旁","邦","棒","膀","绑","傍","榜","梆","氆","浜","磅","蒡","蚌","螃","谤","镑");
pArr[j++]=new Array("bao","报","保","包","宝","抱","暴","炮","薄","爆","胞","饱","剥","堡","鲍","刨","孢","掊","煲","脬","苞","苴","葆","裒","褒","褓","褴","豹","趵","铇","雹","鸨");
pArr[j++]=new Array("be","本","被","北","备","背","奔","悲","辈","杯","臂");
pArr[j++]=new Array("bei","被","北","备","背","悲","辈","杯","臂","贝","倍","碑","卑","呗","埤","孛","庳","悖","惫","焙","狈","碚","萆","蓓","蜚","褙","跋","邶","鐾","钡","陂","鞴","鹎");
pArr[j++]=new Array("ben","本","奔","笨","坌","夯","畚","苯","贲","锛","唪");
pArr[j++]=new Array("beng","唪","嘣","堋","崩","抨","泵","甏","甭","绷","绷","蚌","蹦","迸","镚");
pArr[j++]=new Array("bi","比","必","笔","毕","秘","避","臂","币","壁","闭","逼","鼻","彼","碧","辟","拂","毙","鄙","蔽","弊","俾","匕","吡","哔","埤","妣","婢","嬖","庇","庳","弼","愎","敝","枇","檗","殍","毖","泌","滗","濞","狴","璧","畀","痹","睥","瞥","秕","筚","箅","篦","纰","舭","芘","荜","荸","菝","萆","蓖","薜","蘖","蚍","裨","襞","诐","贲","赑","跛","跸","鐾","铋","陂","陛","陴","馥","髀","鲾");
pArr[j++]=new Array("bia","便","表","边","变","编","标","遍","彪","辩","鞭");
pArr[j++]=new Array("bian","便","边","变","编","遍","辩","鞭","辨","辫","扁","匾","卞","弁","忭","汴","煸","砭","碥","稹","窆","笾","缏","苄","蝙","褊","贬","鳊");
pArr[j++]=new Array("biao","表","标","彪","镖","剽","婊","嫖","杓","灬","焱","瘭","膘","苞","裱","鏖","镳","飑","飙","飚","骉","骠","髟","鳔");
pArr[j++]=new Array("bie","别","憋","瘪","蹩","鳖");
pArr[j++]=new Array("bin","宾","彬","滨","斌","傧","摈","殡","浜","濒","玢","禀","缤","膑","豳","镔","髌","鬓");
pArr[j++]=new Array("bing","并","兵","病","冰","柄","屏","饼","丙","冫","廪","摒","枋","槟","炳","燹","禀","秉","迸","邴");
pArr[j++]=new Array("bo","白","百","般","波","伯","博","播","薄","勃","拨","柏","剥","玻","脖","泊","卜","驳","搏","魄","亳","佰","啵","孛","帛","悖","擘","檗","泺","渤","溥","礴","箔","簸","簿","膊","舶","艴","荸","菔","菠","蕃","薜","蘖","袯","趵","跛","踣","钵","钹","铂","镈","雹","饽","馎","鲅","鲌","鹁");
pArr[j++]=new Array("bu","不","部","步","布","补","捕","堡","怖","卜","卟","卩","哺","埔","埠","惚","晡","溥","瓿","簿","逋","醭","钚","钸","鞴");
pArr[j++]=new Array("c","出","成","从","长","此","重","次","产","处","才");
pArr[j++]=new Array("ca","擦","拆","嚓","礤","才","参","采","藏","草","菜");
pArr[j++]=new Array("cai","才","采","菜","财","材","彩","裁","猜","蔡","踩","睬");
pArr[j++]=new Array("can","参","残","餐","惨","灿","孱","惭","掺","昝","璨","粲","蚕","骖","黪");
pArr[j++]=new Array("cang","藏","苍","仓","舱","伧","沧","臧","鸧");
pArr[j++]=new Array("cao","草","操","曹","嘈","屮","槽","漕","澡","糙","艚","螬");
pArr[j++]=new Array("ce","策","测","侧","册","厕","恻","栅","赦","曾");
pArr[j++]=new Array("cen","参","岑","涔","曾","层","噌","缯","蹭");
pArr[j++]=new Array("ceng","曾","层","噌","缯","蹭");
pArr[j++]=new Array("ch","出","成","长","重","产","处","场","车","常","吃");
pArr[j++]=new Array("cha","查","差","察","茶","插","刹","叉","吒","咤","喳","姹","岔","搋","搽","杈","楂","槎","檫","汊","痄","碴","苴","茬","荼","衩","诧","锸","镲","馇");
pArr[j++]=new Array("chai","差","柴","拆","侪","瘥","茈","虿","豺","钗");
pArr[j++]=new Array("chan","产","单","颤","禅","缠","阐","冁","刬","啴","婵","孱","廛","忏","掸","掺","搀","浐","潺","澶","羼","苫","蒇","蝉","蟾","觇","谄","谗","躔","铲","镵","馋","骣");
pArr[j++]=new Array("chang","长","场","常","厂","唱","尝","偿","昌","畅","肠","倡","敞","伥","娼","嫦","徜","怅","惝","昶","氅","猖","玚","苌","菖","裳","锠","阊","鬯","鲳","鲿");
pArr[j++]=new Array("chao","朝","超","潮","吵","抄","炒","嘲","绰","剿","巢","怊","晁","焯","耖","钞");
pArr[j++]=new Array("che","车","彻","尺","撤","扯","坼","屮","掣","澈","砗","辙");
pArr[j++]=new Array("chen","称","陈","沉","晨","尘","沈","臣","辰","趁","衬","琛","嗔","宸","忱","抻","榇","橙","湛","疹","眈","碜","秤","肜","胂","谌","谶","郴","龀");
pArr[j++]=new Array("cheng","成","城","程","称","承","枪","乘","盛","诚","撑","呈","惩","澄","丞","伧","噌","埕","塍","晟","枨","柽","樘","橙","浈","瞠","秤","蛏","裎","赪","逞","郢","酲","铖","铛","骋");
pArr[j++]=new Array("chi","吃","持","迟","赤","尺","池","驰","耻","痴","齿","斥","嗤","匙","侈","傺","叱","哆","哧","啻","坻","墀","媸","弛","彳","搋","敕","沱","炽","瘛","眙","眵","笞","篪","翅","胝","芪","茌","茬","蚩","螭","褫","豉","踅","踟","郗","饬","魑");
pArr[j++]=new Array("cho","重","冲","充","抽","仇","崇","愁","丑","臭","筹");
pArr[j++]=new Array("chon","重","冲","充","崇","虫","宠","忡","憧","潼","盅");
pArr[j++]=new Array("chong","重","冲","充","崇","虫","宠","忡","憧","潼","盅","舂","艟","茧","茺","酮","铳");
pArr[j++]=new Array("chou","抽","仇","愁","丑","臭","筹","酬","绸","瞅","俦","帱","惆","搐","焘","畴","瘳","稠","踌","雠");
pArr[j++]=new Array("chu","出","处","初","除","楚","础","触","储","厨","畜","亍","刍","怵","憷","搐","杵","楮","樗","橱","滁","矗","硫","絮","绌","蜍","褚","蹰","锄","雏","黜");
pArr[j++]=new Array("chua","传","创","穿","船","窗","床","川","串","闯","喘");
pArr[j++]=new Array("chuai","嘬","揣","揣","搋","踹","蹉");
pArr[j++]=new Array("chuan","传","穿","船","川","串","喘","巛","椽","氚","舛","舡","遄","钏");
pArr[j++]=new Array("chuang","创","窗","床","闯","幢","囱","怆","疮","舂");
pArr[j++]=new Array("chui","吹","垂","锤","捶","棰","椎","槌","炊","陲");
pArr[j++]=new Array("chun","春","纯","唇","淳","蠢","椿","沌","肫","莼","醇","鹑");
pArr[j++]=new Array("chuo","绰","啜","戳","淖","焯","簇","缀","荃","蔟","踔","踱","躇","辍","醛","龊");
pArr[j++]=new Array("ci","此","次","差","刺","词","辞","慈","赐","磁","瓷","兹","伺","嵯","恣","疵","祠","粢","糍","茈","茨","蚝","螅","訾","趑","雌","鹚");
pArr[j++]=new Array("co","从","匆","聪","丛","凑","葱","囱","揍","枞","楱");
pArr[j++]=new Array("con","从","匆","聪","丛","葱","囱","枞","淙","琮","璁");
pArr[j++]=new Array("cong","从","匆","聪","丛","葱","囱","枞","淙","琮","璁","苁","骢");
pArr[j++]=new Array("cou","凑","揍","楱","簇","腠","蔟","辏");
pArr[j++]=new Array("cu","促","粗","醋","卒","徂","槭","殂","猝","簇","蔟","蹙","蹴","酢");
pArr[j++]=new Array("cua","窜","撺","汆","爨","篡","蹿","镩");
pArr[j++]=new Array("cuan","窜","撺","汆","爨","篡","蹿","镩");
pArr[j++]=new Array("cui","脆","翠","崔","衰","催","粹","摧","啐","悴","榱","橇","毳","淬","璀","瘁","缞","萃","隹");
pArr[j++]=new Array("cun","存","村","寸","忖","浚","皴");
pArr[j++]=new Array("cuo","错","差","措","挫","厝","嵯","搓","撮","痤","瘥","矬","磋","脞","蹉","锉","鹾");
pArr[j++]=new Array("d","的","大","到","地","道","得","对","多","都","当");
pArr[j++]=new Array("da","大","打","达","答","塔","搭","哒","妲","怛","沓","疸","瘩","瘩","笪","耷","荙","褡","跶","酂","靼","鞑");
pArr[j++]=new Array("dai","大","代","带","待","呆","袋","戴","贷","逮","歹","傣","呔","埭","岱","怠","棣","殆","玳","甙","绐","轪","迨","逯","黛");
pArr[j++]=new Array("dan","但","单","石","担","弹","丹","淡","胆","旦","蛋","诞","儋","啖","惮","掸","檐","殚","氮","湛","澶","澹","疸","瘅","瘅","眈","箪","耽","聃","膻","萏","蜒","詹","赡","郸","钽");
pArr[j++]=new Array("dang","当","党","荡","挡","档","凼","垱","宕","玚","珰","砀","筜","菪","裆","谠","铛");
pArr[j++]=new Array("dao","到","道","倒","导","刀","岛","盗","稻","蹈","悼","捣","叨","刂","帱","忉","梼","氘","洮","祷","纛","鱽");
pArr[j++]=new Array("de","的","地","得","德","锝","陟","等","登","邓");
pArr[j++]=new Array("dei","得");
pArr[j++]=new Array("den","等","登","邓","灯","瞪","凳","澄","噔","嶝","戥");
pArr[j++]=new Array("deng","等","登","邓","灯","瞪","凳","澄","噔","嶝","戥","橙","眙","磴","簦","蹬","镫");
pArr[j++]=new Array("di","的","地","第","提","弟","底","低","敌","帝","适","抵","递","滴","狄","迪","蒂","堤","笛","嘀","坻","娣","嫡","柢","棣","氐","涤","睇","砥","碲","籴","缔","羝","翟","胝","芍","荻","莜","觌","诋","谛","蹄","轪","邸","镝","骶");
pArr[j++]=new Array("dia","嗲","点","电","调","店","掉","典","鸟","雕","殿");
pArr[j++]=new Array("dian","点","电","店","典","殿","颠","淀","甸","奠","佃","坫","垫","巅","惦","拈","掂","涎","滇","玷","癜","癫","碘","簟","蜓","踮","钿","阽","靛");
pArr[j++]=new Array("diao","调","掉","鸟","雕","钓","吊","凋","刁","叼","碉","稠","窎","莜","蜩","貂","踔","钌","铞","鲷");
pArr[j++]=new Array("die","爹","跌","叠","蝶","碟","佚","喋","垤","堞","揲","渫","牒","瓞","窒","绖","耋","褶","谍","蹀","轶","迭","鲽","鳎");
pArr[j++]=new Array("din","定","顶","订","丁","钉","盯","鼎","叮","仃","啶");
pArr[j++]=new Array("ding","定","顶","订","丁","钉","盯","鼎","叮","仃","啶","汀","玎","町","疔","碇","耵","腚","葶","酊","锭","饤");
pArr[j++]=new Array("diu","丢","铥");
pArr[j++]=new Array("do","都","动","东","读","斗","洞","懂","冬","豆","抖");
pArr[j++]=new Array("don","动","东","洞","懂","冬","董","冻","栋","侗","咚");
pArr[j++]=new Array("dong","动","东","洞","懂","冬","董","冻","栋","侗","咚","垌","岽","峒","恫","氡","甬","硐","胨","胴","酮","鸫");
pArr[j++]=new Array("dou","都","读","斗","豆","抖","兜","逗","陡","渎","痘","窦","窬","篼","蔸","蚪","逾","饾");
pArr[j++]=new Array("du","都","度","读","独","毒","督","肚","渡","杜","赌","堵","睹","嘟","妒","椟","橐","渎","牍","犊","碡","竺","笃","纛","芏","蠹","镀","阇","髑","黩");
pArr[j++]=new Array("dua","段","断","端","短","锻","椴","煅","簖","缎","踹");
pArr[j++]=new Array("duan","段","断","端","短","锻","椴","煅","簖","缎","踹");
pArr[j++]=new Array("dui","对","队","堆","敦","兑","怼","憝","槌","碓","镦");
pArr[j++]=new Array("dun","顿","盾","吨","敦","蹲","囤","墩","沌","炖","盹","砘","礅","豚","趸","遁","钝");
pArr[j++]=new Array("duo","多","度","夺","躲","朵","舵","堕","亸","剁","咄","哆","哚","垛","惰","掇","柁","棰","沱","沲","缍","裰","跺","踱","铎","锗","隋","饳","驮");
pArr[j++]=new Array("e","阿","恶","额","俄","饿","哦","鹅","厄","呃","噩","垩","娥","婀","屙","峨","愕","扼","猗","硪","胺","腭","苊","莪","萼","蛤","蛾","讹","谔","轭","遏","邑","鄂","钶","锷","阏","隘","颚","鳄","鹗");
pArr[j++]=new Array("ei","哎","诶","诶");
pArr[j++]=new Array("en","恩","摁","蒽");
pArr[j++]=new Array("er","而","二","儿","尔","耳","佴","洱","濡","珥","贰","迩","铒","饵","鲕","鸸");
pArr[j++]=new Array("f","发","方","分","法","反","放","风","服","非","夫");
pArr[j++]=new Array("fa","发","法","乏","罚","伐","垡","珐","砝","筏","阀");
pArr[j++]=new Array("fan","反","饭","翻","犯","范","凡","番","烦","繁","返","泛","贩","帆","幡","梵","樊","燔","畈","矾","蕃","藩","蘩","蟠","袢","蹯","钒");
pArr[j++]=new Array("fang","方","放","房","访","防","仿","芳","妨","坊","纺","匚","彷","枋","肪","舫","邡","邡","钫","鲂","鳑");
pArr[j++]=new Array("fe","分","风","非","飞","费","份","封","纷","峰","丰");
pArr[j++]=new Array("fei","非","飞","费","斐","废","菲","肥","匪","啡","肺","沸","吠","妃","悱","扉","榧","淝","狒","痱","痱","砩","祓","篚","绯","翡","腓","芾","蜚","裴","诽","贲","镄","霏","鲱");
pArr[j++]=new Array("fen","分","份","纷","奋","愤","粉","芬","吩","氛","坟","粪","焚","偾","忿","棼","棼","汾","瀵","燔","玢","豮","贲","酚","鲼","鼢");
pArr[j++]=new Array("feng","风","封","峰","丰","锋","凤","奉","枫","疯","逢","缝","冯","蜂","讽","俸","唪","沣","烽","砜","葑","蚌","赗","逄","酆");
pArr[j++]=new Array("fo","佛","否","缶");
pArr[j++]=new Array("fou","否","缶");
pArr[j++]=new Array("fu","服","夫","父","府","复","福","副","负","妇","富","佛","付","附","幅","伏","扶","赴","浮","符","腐","腹","咐","抚","覆","傅","弗","肤","芙","俯","拂","俘","赋","甫","缚","辅","敷","凫","匐","呋","呒","孚","孵","宓","幞","怫","拊","掊","斧","桴","氟","涪","溥","滏","砩","祓","稃","绂","绋","罘","脯","腑","艴","芾","苻","茯","莆","莩","菔","蚨","蜉","蝠","蝮","袱","讣","赙","趺","跗","辐","郛","釜","阜","阝","鞴","韨","馥","驸","鲋","鳆","麸","黻","黼");
pArr[j++]=new Array("g","国","个","过","公","高","工","给","间","关","感");
pArr[j++]=new Array("ga","界","夹","咖","胳","嘎","噶","尕","尜","尬","旮","轧","钆","骱");
pArr[j++]=new Array("gai","该","改","概","盖","丐","垓","戤","溉","胲","芥","赅","钙","阂","陔","骸");
pArr[j++]=new Array("gan","间","感","干","敢","赶","甘","乾","杆","肝","坩","尴","擀","旰","柑","橄","泔","淦","澉","疳","矸","秆","竿","竿","绀","苷","赣","酐","鳡");
pArr[j++]=new Array("gang","港","刚","钢","岗","纲","缸","冈","扛","亢","戆","杠","筻","罡","肛","肮","舡","颃");
pArr[j++]=new Array("gao","高","告","稿","搞","糕","膏","咎","杲","桕","槁","槔","皋","睾","篙","缟","羔","蒿","藁","诰","郜","锆","镐");
pArr[j++]=new Array("ge","个","合","各","革","格","哥","歌","隔","割","阁","葛","戈","搁","胳","仡","咯","哿","嗝","噶","圪","塥","搿","烙","疙","砝","硌","纥","膈","舸","菏","虼","蛤","袼","铬","镉","阖","颌","骼","髂","鬲","鸽");
pArr[j++]=new Array("gei","给","胲");
pArr[j++]=new Array("gen","跟","根","哏","艮","茛","更","颈","耕","耿","亘");
pArr[j++]=new Array("geng","更","颈","耕","耿","亘","哽","埂","庚","梗","炅","炔","粳","绠","羹","赓","邢","鲠","鹒");
pArr[j++]=new Array("go","公","工","共","功","红","供","够","构","攻","狗");
pArr[j++]=new Array("gon","公","工","共","功","红","供","攻","宫","恭","贡");
pArr[j++]=new Array("gong","公","工","共","功","红","供","攻","宫","恭","贡","躬","拱","弓","巩","唝","廾","汞","珙","肱","蚣","蛩","觥","赣","龚");
pArr[j++]=new Array("gou","够","构","狗","购","沟","勾","钩","佝","垢","媾","岣","彀","枸","笱","篝","缑","耩","苟","觏","诟","逅","遘","鞲","骺");
pArr[j++]=new Array("gu","告","古","故","姑","顾","股","骨","鼓","谷","固","孤","估","贾","雇","辜","咕","嘏","崮","梏","毂","汩","沽","牯","牿","瓠","痼","皋","瞽","箍","罟","胍","臌","菇","菰","蛄","蛊","觚","诂","酤","钴","钴","锢","馉","骰","鲴","鸪","鹄","鹘");
pArr[j++]=new Array("gua","挂","瓜","寡","刮","剐","卦","呱","栝","聒","胍","脶","蜗","褂","诖","鸹");
pArr[j++]=new Array("guai","怪","乖","拐");
pArr[j++]=new Array("guan","关","管","观","官","馆","惯","冠","贯","灌","罐","倌","掼","擐","斡","棺","浣","涫","盥","矜","纶","缶","脘","莞","菅","鳏","鹳");
pArr[j++]=new Array("guang","光","广","逛","咣","桄","潢","犷","胱");
pArr[j++]=new Array("gui","规","归","贵","鬼","桂","跪","柜","轨","龟","瑰","傀","刽","刿","匦","匮","圭","妫","宄","庋","撅","晷","桧","洼","炅","炔","癸","皈","眭","瞆","硅","祈","簋","觖","诡","蹶","闺","隗","鲑","鳜");
pArr[j++]=new Array("gun","滚","棍","磙","绲","衮","辊","鲧");
pArr[j++]=new Array("guo","国","过","果","郭","锅","裹","呙","埚","崞","帼","掴","椁","涡","猓","聒","虢","蜮","蜾","蝈","蠃","馃","馘");
pArr[j++]=new Array("h","和","会","后","好","还","行","回","话","很","海");
pArr[j++]=new Array("ha","哈","虾","獬","蛤","铪","好","还","行","海","孩");
pArr[j++]=new Array("hai","还","海","孩","害","咳","亥","嗨","氦","胲","醢","颏","骇","骸");
pArr[j++]=new Array("han","汉","喊","含","寒","汗","韩","罕","憾","翰","涵","函","旱","撼","悍","憨","捍","撖","擀","旰","晗","泔","澉","瀚","焊","焓","犴","菡","蚶","邗","邯","酐","酣","闬","顸","颌","颔","鼾");
pArr[j++]=new Array("hang","行","航","杭","巷","吭","夯","桁","沆","炕","绗","肮","酐","颃","鸻");
pArr[j++]=new Array("hao","好","号","毫","豪","浩","耗","嗥","嚆","嚎","壕","昊","涸","濠","灏","皋","皓","睾","蒿","薅","蚝","貉","郝","镐","颢");
pArr[j++]=new Array("he","和","何","合","河","喝","核","吓","赫","荷","贺","盒","呵","鹤","禾","劾","嗑","嗬","壑","曷","洽","涸","盍","硅","纥","翮","耠","苛","菏","藿","蚵","蝎","褐","诃","貉","钾","阂","阖","颌","饸","鲄","鹖","龁");
pArr[j++]=new Array("hei","黑","嘿");
pArr[j++]=new Array("hen","很","恨","狠","痕","哏","艮","行","横","哼","衡");
pArr[j++]=new Array("heng","行","横","哼","衡","恒","亨","桁","珩","绗","蘅","訇","鸻","黉");
pArr[j++]=new Array("ho","后","红","候","洪","厚","後","轰","鸿","宏","侯");
pArr[j++]=new Array("hon","红","洪","轰","鸿","宏","哄","虹","唝","弘","泓");
pArr[j++]=new Array("hong","红","洪","轰","鸿","宏","哄","虹","唝","弘","泓","洚","烘","纮","荭","蕻","薨","訇","讧","闳","黉");
pArr[j++]=new Array("hou","后","候","厚","後","侯","喉","吼","猴","堠","瘊","篌","糇","逅","骺","鲎","鲘");
pArr[j++]=new Array("hu","和","许","乎","胡","户","护","呼","忽","湖","狐","互","核","虎","糊","沪","壶","冱","唬","唿","囫","岵","弧","怙","惚","戽","扈","斛","槲","汩","浒","滹","烀","煳","猢","琥","瑚","瓠","祜","笏","胍","芋","芴","葫","虍","蝴","觳","轷","酏","醐","鳠","鹄","鹕","鹘","鹱");
pArr[j++]=new Array("hua","话","化","华","花","划","画","滑","哗","婳","桦","狯","猾","砉","稞","豁","踝","铧","骅");
pArr[j++]=new Array("huai","怀","坏","淮","孬","徊","槐","踝");
pArr[j++]=new Array("huan","还","欢","换","环","缓","幻","患","唤","圜","垸","奂","宦","寰","擐","桓","洹","浣","涣","漶","焕","獾","瑗","痪","皖","眩","缳","脘","苋","萑","豢","逭","郇","锾","镮","阛","鬟","鲩");
pArr[j++]=new Array("huang","黄","皇","荒","晃","慌","惶","煌","谎","恍","凰","幌","徨","湟","潢","潢","璜","癀","磺","篁","簧","肓","蝗","蟥","遑","锽","隍","鳇");
pArr[j++]=new Array("hui","会","回","挥","汇","灰","辉","惠","慧","毁","悔","恢","绘","徽","溃","贿","讳","卉","咴","哕","喙","彗","徊","恚","悝","戯","晖","晦","桧","洄","烩","珲","皓","眭","秽","缋","茴","荟","蕙","虺","蛔","蝰","蟪","袆","诙","诲","钺","阓","隳","颒","麾");
pArr[j++]=new Array("hun","婚","混","魂","昏","浑","溷","珲","荤","诨","阍","馄");
pArr[j++]=new Array("huo","和","话","活","或","火","获","伙","货","祸","惑","霍","劐","嚯","壑","夥","攉","瓠","砉","硅","耠","藿","蠖","豁","钬","锪","镬","鳠","鹱");
pArr[j++]=new Array("j","就","家","见","经","将","进","其","己","机","给");
pArr[j++]=new Array("ji","其","己","机","给","几","期","系","计","及","记","革","即","技","基","极","际","济","集","级","奇","急","纪","击","既","辑","激","寄","继","积","忌","吉","迹","鸡","季","骑","疾","籍","挤","寂","绩","祭","饥","妓","肌","脊","圾","剂","藉","讥","姬","丌","乩","亟","伎","佶","偈","冀","剞","叽","咭","哜","唧","墼","嫉","屐","岌","嵇","嵴","彐","悸","戟","戢","掎","揖","暨","棘","楫","殛","汲","洎","犄","猗","玑","畸","畿","疵","瘠","瘵","睽","瞿","矶","秸","稷","稽","笄","笈","箕","粢","缉","羁","脔","芨","芰","荠","萁","蒺","蓟","蕺","虮","觊","赍","跻","跽","郅","钑","霁","骥","鱾","鲚","鲫","鹡","麂","齑");
pArr[j++]=new Array("jia","家","加","价","假","架","甲","佳","夹","驾","嫁","嘉","贾","颊","稼","伽","嘏","岬","恝","戛","拮","挟","枷","柙","槚","浃","珈","痂","瘕","笳","胛","茄","荚","葭","蛱","袈","袷","跏","迦","郏","钾","铗","铪","镓","颉","饸","骱");
pArr[j++]=new Array("jian","见","间","件","建","剑","渐","简","坚","监","健","检","肩","减","尖","兼","奸","箭","舰","艰","键","鉴","剪","践","荐","贱","捡","拣","煎","俭","僭","囝","戋","戬","搛","枧","柬","楗","槛","歼","毽","沮","涧","湔","湛","溅","牮","犍","犴","睑","硷","碱","笕","笺","箴","缄","缣","翦","腱","茛","茧","菅","蒹","裥","謇","谏","谫","谮","趼","踺","蹇","钘","锏","鞯","饯","鲣","鳒","鹣");
pArr[j++]=new Array("jiang","将","强","江","讲","奖","降","蒋","疆","虹","匠","姜","僵","酱","浆","桨","洚","犟","礓","糨","绛","缰","耩","茳","螀","襁","豇","鳉");
pArr[j++]=new Array("jiao","教","叫","觉","交","校","脚","较","角","焦","轿","娇","骄","郊","缴","嚼","胶","搅","浇","绞","佼","侥","僬","剿","噍","姣","峤","徼","徼","挢","敫","椒","湫","爝","狡","皎","矫","矫","礁","窖","艽","茭","荞","菽","蕉","蛟","跤","酵","醮","铰","饺","鲛","鹪");
pArr[j++]=new Array("jie","家","界","解","接","结","价","节","姐","街","阶","介","借","届","杰","截","洁","戒","皆","揭","捷","劫","竭","藉","偈","偕","卩","喈","嗟","婕","孑","廨","拮","栉","桀","桔","楷","獬","疖","疥","睫","砝","碣","秸","羯","芥","苴","葜","蚧","袷","讦","诘","诫","锴","颉","骱","髻","鲒","鹖");
pArr[j++]=new Array("jin","进","金","今","近","尽","紧","仅","禁","劲","津","斤","锦","筋","谨","晋","巾","浸","襟","卺","噤","堇","妗","廑","槿","湛","烬","瑾","矜","缙","肋","荩","衿","觐","赆","钅","靳","馑");
pArr[j++]=new Array("jing","经","京","精","竟","惊","境","静","景","警","睛","靖","劲","敬","竞","净","镜","径","井","晶","颈","儆","兢","刭","婧","弪","憬","旌","晟","檠","泾","烃","獍","痉","箐","粳","肼","胫","腈","茎","荆","菁","蜻","迳","阱","陉","靓","鲸","黥");
pArr[j++]=new Array("jio","垧","扃","炅","炯","窘","迥","颎");
pArr[j++]=new Array("jion","垧","扃","炅","炯","窘","迥","颎");
pArr[j++]=new Array("jiong","垧","扃","炅","炯","窘","迥","颎");
pArr[j++]=new Array("jiu","就","九","究","久","酒","救","旧","舅","纠","僦","厩","咎","啾","揪","柩","桕","湫","灸","玖","疚","缪","臼","艽","蝤","赳","赳","阄","韭","鬏","鸠","鹫");
pArr[j++]=new Array("ju","车","据","且","局","举","句","具","居","剧","巨","聚","距","拒","惧","俱","柜","矩","拘","菊","倨","咀","屦","掬","枸","桔","椐","榉","榘","橘","沮","炬","犋","狙","琚","疽","瞿","窭","苣","苴","莒","菹","蛆","裾","讵","趄","踞","踽","遽","鄹","醵","钜","锔","锯","雎","鞠","鞫","飓","驹","鬻","鲏","龃");
pArr[j++]=new Array("jua","卷","圈","捐","倦","娟","桊","泫","涓","狷","甄");
pArr[j++]=new Array("juan","卷","圈","捐","倦","娟","桊","泫","涓","狷","甄","眩","眷","绢","蕊","蜷","蠲","鄄","锩","镌","阮","隽","鹃");
pArr[j++]=new Array("jue","觉","决","绝","脚","角","爵","掘","嚼","倔","劂","厥","嗟","噘","噱","孓","崛","抉","撅","攫","柽","桷","梏","橛","爝","獗","珏","矍","蕞","蕨","蛙","蠼","觖","觳","诀","谲","蹶","镢","阙","鳜");
pArr[j++]=new Array("jun","军","均","君","俊","龟","峻","菌","捃","浚","狻","皲","睃","竣","筠","訇","逡","郡","钧","隽","馂","骏","鲪","麇");
pArr[j++]=new Array("k","会","可","看","开","口","科","快","空","克","客");
pArr[j++]=new Array("ka","卡","刮","咖","喀","佧","咔","咯","胩","髂","看");
pArr[j++]=new Array("kai","开","凯","慨","剀","垲","忾","恺","揩","楷","溘","蒈","铠","锎","锴","闿","雉");
pArr[j++]=new Array("kan","看","刊","砍","堪","坎","侃","勘","戡","槛","瞰","莰","阚","龛");
pArr[j++]=new Array("kang","康","抗","慷","扛","亢","伉","沆","炕","糠","肮","钪","闶");
pArr[j++]=new Array("kao","考","靠","烤","尻","拷","栲","槁","犒","铐","鲓");
pArr[j++]=new Array("ke","可","科","克","客","刻","课","颗","柯","渴","棵","磕","咳","壳","哿","嗑","坷","岢","恪","氪","溘","珂","疴","盍","瞌","碣","稞","窠","缂","苛","蚵","蝌","轲","钶","铪","锞","颏","骒","髁");
pArr[j++]=new Array("kei","克");
pArr[j++]=new Array("ken","肯","恳","啃","垦","裉","颀","龂","龈","坑","吭");
pArr[j++]=new Array("keng","坑","吭","硁","硎","胫","铿");
pArr[j++]=new Array("ko","口","空","恐","控","孔","扣","佝","倥","叩","寇");
pArr[j++]=new Array("kon","空","恐","控","孔","倥","崆","穹","箜");
pArr[j++]=new Array("kong","空","恐","控","孔","倥","崆","穹","箜");
pArr[j++]=new Array("kou","口","扣","佝","叩","寇","抠","挎","筘","芤","蔻");
pArr[j++]=new Array("ku","苦","哭","库","裤","酷","枯","刳","喾","堀","挎","窟","绔","绹","轱","骷");
pArr[j++]=new Array("kua","跨","夸","垮","侉","挎","胯","锞","髁","会","快");
pArr[j++]=new Array("kuai","会","快","块","筷","侩","呙","哙","栝","桧","浍","狯","脍","蒉","蒯","郐","魁","鲙");
pArr[j++]=new Array("kuan","款","宽","髋","况","狂","矿","旷","框","匡","哐");
pArr[j++]=new Array("kuang","况","狂","矿","旷","框","匡","哐","圹","夼","湟","眶","磺","筐","纩","诓","诓","诳","贶","邝");
pArr[j++]=new Array("kui","亏","愧","溃","奎","傀","匮","喟","喹","夔","岿","悝","愦","揆","暌","盔","睽","瞆","窥","篑","聩","臾","葵","蒉","蝰","觖","跬","逵","隗","顷","馈","馗","骙","魁");
pArr[j++]=new Array("kun","困","昆","坤","壸","巛","悃","捆","琨","裈","醌","锟","阃","髡","鲲","鹍","麇");
pArr[j++]=new Array("kuo","括","扩","阔","廓","栝","蛞");
pArr[j++]=new Array("l","了","来","里","老","两","理","力","立","路","利");
pArr[j++]=new Array("la","落","拉","啦","辣","喇","腊","蜡","剌","垃","摺","旯","瘌","癞","砬","邋","镴");
pArr[j++]=new Array("lai","来","厉","赖","莱","俫","崃","徕","梾","涞","濑","癞","睐","籁","赉","铼","黧");
pArr[j++]=new Array("lan","兰","栏","蓝","烂","览","拦","懒","篮","滥","缆","啉","婪","岚","廪","揽","斓","榄","漤","澜","罱","褴","谰","郴","镧","阑");
pArr[j++]=new Array("lang","浪","郎","朗","狼","廊","啷","榔","琅","稂","羹","莨","蒗","螂","踉","锒","阆","阆");
pArr[j++]=new Array("lao","老","落","劳","络","牢","姥","捞","佬","唠","崂","栎","栳","涝","潦","潦","烙","獠","痨","耢","蓼","酪","醪","铑","铹");
pArr[j++]=new Array("le","了","乐","勒","仂","叻","捋","泐","肋","饹","鳓");
pArr[j++]=new Array("lei","类","泪","雷","累","勒","垒","儡","嘞","埒","嫘","擂","擂","檑","漯","磊","缧","羸","耒","肋","蕾","诔","酹","镭");
pArr[j++]=new Array("len","冷","愣","塄","棱","楞");
pArr[j++]=new Array("leng","冷","愣","塄","棱","楞");
pArr[j++]=new Array("li","里","理","力","立","利","李","历","离","丽","礼","例","厉","励","黎","璃","哩","莉","粒","隶","梨","栗","俐","俚","俪","傈","厘","吏","呖","唳","喱","坜","娌","嫠","悝","捩","枥","栎","沥","溧","漓","澧","牦","犁","狸","猁","珞","疠","疬","痢","砬","砺","砾","硌","笠","篥","篱","粝","缡","罹","翮","苈","荔","莅","蓠","藜","蛎","蜊","蠡","詈","跞","轹","逦","郦","酾","醴","锂","镉","雳","霾","骊","髦","鬲","鲡","鲤","鳢","鹂","黧");
pArr[j++]=new Array("lia","俩","了","两","连","联","量","脸","料","亮","练");
pArr[j++]=new Array("lian","连","联","脸","练","恋","怜","莲","炼","廉","帘","链","奁","娈","敛","梿","楝","殓","涟","潋","濂","琏","瞵","碾","羸","膦","臁","苓","莶","蔹","蠊","裢","裣","镰","鲢");
pArr[j++]=new Array("liang","两","量","亮","良","粮","辆","梁","凉","俩","谅","唡","墚","晾","椋","粱","莨","踉","辌","阆","魉");
pArr[j++]=new Array("liao","了","料","疗","聊","辽","僚","寥","嘹","寮","尥","廖","撂","撩","撩","潦","燎","燎","獠","缪","缭","蓼","钌","镣","鹨","鹩");
pArr[j++]=new Array("lie","列","烈","裂","劣","猎","冽","咧","戾","捩","洌","膊","趔","躐","邋","鬣");
pArr[j++]=new Array("lin","林","临","邻","琳","淋","凛","吝","啉","嶙","廪","懔","檩","瞵","磷","禀","粼","膦","蔺","赁","躏","辚","遴","霖","鳞","麟");
pArr[j++]=new Array("ling","领","令","另","灵","零","龄","凌","玲","铃","陵","岭","伶","呤","呤","囹","拎","柃","棂","棱","泠","瓴","磷","绫","羚","翎","聆","苓","菱","蛉","酃","鲮","鸰");
pArr[j++]=new Array("liu","六","流","留","陆","刘","柳","溜","碌","旒","榴","泖","泵","浏","熘","琉","瘤","硫","绺","蒌","蓼","遛","鎏","铆","锍","镏","镠","飗","馏","骝","鹠");
pArr[j++]=new Array("lo","咯","龙","楼","露","弄","隆","笼","漏","搂","陋");
pArr[j++]=new Array("lon","龙","弄","隆","笼","拢","胧","聋","垄","咙","垅");
pArr[j++]=new Array("long","龙","弄","隆","笼","拢","胧","聋","垄","咙","垅","昽","栊","泷","珑","癃","眬","砻","窿","茏","陇");
pArr[j++]=new Array("lou","楼","露","漏","搂","陋","偻","喽","娄","嵝","瘘","窭","篓","耧","蒌","蝼","镂","髅");
pArr[j++]=new Array("lu","路","陆","露","录","绿","鲁","卢","炉","鹿","碌","芦","庐","卤","噜","垆","戮","掳","撸","栌","橹","泸","渌","漉","潞","璐","瘳","禄","箓","簏","胪","舻","蓼","虏","赂","轳","辂","辘","逯","酪","镥","颅","鲈","鸬","鹭","麓");
pArr[j++]=new Array("lua","乱","卵","娈","孪","峦","挛","栾","滦","脔","銮");
pArr[j++]=new Array("luan","乱","卵","娈","孪","峦","挛","栾","滦","脔","銮","鸾");
pArr[j++]=new Array("lun","论","轮","伦","沦","仑","囵","抡","纶");
pArr[j++]=new Array("luo","落","罗","络","洛","逻","骆","裸","萝","锣","倮","捋","摞","椤","橐","氇","泺","漯","烙","猓","猡","珞","瘰","硌","箩","脶","荦","蔂","蜾","螺","蠃","蠡","袼","跞","酪","铬","镙","雒","骡");
pArr[j++]=new Array("lv","律","率","旅","绿","虑","吕","履","缕","侣","偻","屡","嵝","捋","榈","氯","滤","瘘","稆","膂","褛","铝","闾","驴");
pArr[j++]=new Array("lue","略","掠","撂","锊");
pArr[j++]=new Array("m","们","么","没","无","面","民","美","明","名","门");
pArr[j++]=new Array("ma","马","吗","妈","骂","麻","摩","码","嘛","玛","抹","唛","嬷","杩","犸","祃","蚂","蚂","蟆","貉","靡","麽");
pArr[j++]=new Array("mai","买","卖","麦","埋","脉","迈","劢","狸","荬","霡","霾");
pArr[j++]=new Array("man","满","慢","漫","埋","曼","蛮","瞒","墁","幔","熳","缦","蔓","螨","谩","蹒","镘","鞔","颟","馒","鳗");
pArr[j++]=new Array("mang","忙","茫","盲","芒","氓","漭","瞢","硭","莽","蟒","邙","铓");
pArr[j++]=new Array("mao","毛","冒","贸","貌","矛","猫","帽","茅","茂","卯","峁","懋","旄","昴","泖","牟","牦","瑁","瞀","耄","茆","蝥","蟊","袤","铆","锚","髦");
pArr[j++]=new Array("me","么","麼","末","麽","们","没","美","门","每","妹");
pArr[j++]=new Array("mei","没","美","每","妹","梅","眉","媒","枚","煤","谜","媚","霉","昧","玫","寐","嵋","楣","浼","湄","猸","瑁","糜","莓","袂","酶","镁","镅","靡","魅","鹛");
pArr[j++]=new Array("men","们","门","闷","懑","扪","汶","满","焖","钔","鞔");
pArr[j++]=new Array("meng","梦","蒙","猛","盟","孟","朦","氓","勐","懵","檬","甍","瞑","瞢","礞","艋","艨","苎","萌","虻","蜢","蟊","蟒","蠓","锰","鹲","黾");
pArr[j++]=new Array("mi","米","密","秘","迷","弥","蜜","谜","觅","佴","咪","嘧","宓","幂","弭","敉","汨","泌","溟","狝","猕","眯","眯","祢","糜","糸","縻","脒","芈","蘼","谧","醚","靡","麋");
pArr[j++]=new Array("mia","面","免","妙","描","苗","庙","棉","绵","眠","勉");
pArr[j++]=new Array("mian","面","免","棉","绵","眠","勉","缅","冕","娩","沔","泯","渑","湎","眄","瞑","腼","黾");
pArr[j++]=new Array("miao","妙","描","苗","庙","秒","渺","喵","杪","淼","眇","瞄","缈","缪","藐","蜱","邈","钞","鹋");
pArr[j++]=new Array("mie","灭","蔑","乜","咩","篾","芈","蠛");
pArr[j++]=new Array("min","民","敏","岷","悯","愍","抿","汶","泯","渑","玟","珉","缗","苠","闵","闽","鳘","黾");
pArr[j++]=new Array("ming","明","名","命","鸣","盟","铭","冥","暝","溟","皿","瞑","茗","萌","螟","酩");
pArr[j++]=new Array("miu","谬","缪");
pArr[j++]=new Array("mo","么","没","无","万","模","莫","默","摸","麼","末","摩","磨","魔","脉","漠","墨","抹","陌","寞","沫","膜","嫫","摹","殁","瘼","秣","耱","茉","蓦","藐","蘑","蟆","袜","谟","貉","貊","貘","镆","霡","靡","馍","麽");
pArr[j++]=new Array("mou","某","谋","侔","厶","哞","毋","牟","眸","瞀","缪","蛑","蝥","袤","鍪");
pArr[j++]=new Array("mu","目","母","木","模","幕","慕","墓","姆","姥","穆","牧","亩","沐","募","仫","坶","拇","暮","毪","牟","牡","睦","缪","苜","钼","鹜");
pArr[j++]=new Array("n","你","年","那","能","女","内","难","南","呢","拿");
pArr[j++]=new Array("na","那","南","拿","哪","纳","呐","捺","箬","絮","肭","衲","讷","钠","镎");
pArr[j++]=new Array("nai","奶","乃","耐","奈","佴","柰","氖","艿","萘","鼐");
pArr[j++]=new Array("nan","难","南","男","喃","囝","囡","楠","罱","腩","蝻","赧");
pArr[j++]=new Array("nang","囊","囔","攮","曩","馕");
pArr[j++]=new Array("nao","脑","闹","恼","呶","垴","孬","挠","桡","淖","猱","瑙","硇","铙");
pArr[j++]=new Array("ne","呢","哪","呐","疔","讷","那","能","内","嫩");
pArr[j++]=new Array("nei","那","内","哪","馁");
pArr[j++]=new Array("nen","嫩","能");
pArr[j++]=new Array("neng","能");
pArr[j++]=new Array("ng","嗯");
pArr[j++]=new Array("ni","你","呢","尼","泥","拟","逆","倪","妮","腻","伲","匿","坭","嶷","怩","慝","旎","昵","猊","睨","祢","铌","霓","鲵","鹝","鹢");
pArr[j++]=new Array("nia","年","念","娘","鸟","尿","廿","酿","粘","埝","嬲");
pArr[j++]=new Array("nian","年","念","廿","粘","埝","廾","拈","拈","捻","撵","碾","蔫","辇","辗","鲇","鲶","黏");
pArr[j++]=new Array("niang","娘","酿");
pArr[j++]=new Array("niao","鸟","尿","嬲","氽","溺","脲","茑","袅");
pArr[j++]=new Array("nie","捏","乜","啮","嗫","孽","捻","涅","聂","臬","蘖","蹑","镊","镍","陧","颞");
pArr[j++]=new Array("nin","您","宁","凝","佞","咛","拧","攘","柠","泞","狞");
pArr[j++]=new Array("ning","宁","凝","佞","咛","拧","拧","攘","柠","泞","狞","甯","聍","苧");
pArr[j++]=new Array("niu","牛","扭","纽","妞","忸","拗","狃","蚴","钮");
pArr[j++]=new Array("no","农","弄","浓","侬","哝","秾","耨","脓");
pArr[j++]=new Array("non","农","弄","浓","侬","哝","秾","脓");
pArr[j++]=new Array("nong","农","弄","浓","侬","哝","秾","脓");
pArr[j++]=new Array("nou","耨");
pArr[j++]=new Array("nu","怒","努","奴","孥","帑","弩","胬","褥","驽","那");
pArr[j++]=new Array("nua","暖","濡");
pArr[j++]=new Array("nuan","暖","濡");
pArr[j++]=new Array("nuo","那","诺","娜","挪","傩","喏","懦","搦","濡","砹","糯","锘");
pArr[j++]=new Array("nü","女","忸","恧","狃","絮","肭","衄","钕","乇","疟");
pArr[j++]=new Array("nüe","乇","疟","虐","谑");
pArr[j++]=new Array("o","哦","喔","噢","区","欧","偶","呕","怄","殴","沤");
pArr[j++]=new Array("ou","区","欧","偶","呕","呕","怄","殴","沤","瓯","眍","禺","耦","藕","讴","鸥");
pArr[j++]=new Array("p","便","被","平","品","派","片","怕","般","破","批");
pArr[j++]=new Array("pa","派","怕","爬","帕","啪","趴","扒","杷","琶","筢","耙","芭","葩","钯");
pArr[j++]=new Array("pai","派","排","拍","牌","迫","俳","哌","徘","湃","蒎");
pArr[j++]=new Array("pan","般","判","盘","番","胖","盼","叛","拚","潘","畔","攀","弁","扳","拌","樊","泮","爿","皤","磐","蟠","袢","襻","蹒","鄱");
pArr[j++]=new Array("pang","旁","胖","膀","庞","乓","厐","彷","滂","磅","磅","耪","蒡","螃","逄","鳑");
pArr[j++]=new Array("pao","跑","炮","抛","袍","泡","刨","匏","咆","庖","狍","疱","脬","苞","趵","龅");
pArr[j++]=new Array("pe","朋","配","培","碰","陪","彭","佩","赔","鹏","盆");
pArr[j++]=new Array("pei","配","培","陪","佩","赔","呸","妃","帔","徘","旆","沛","淠","碚","胚","艴","茇","蜚","裴","辔","邳","醅","锫","霈");
pArr[j++]=new Array("pen","盆","喷","汾","湓","朋","碰","彭","鹏","捧","棚");
pArr[j++]=new Array("peng","朋","碰","彭","鹏","捧","棚","蓬","砰","篷","膨","嘭","堋","怦","抨","澎","烹","甏","硼","蟛","迸");
pArr[j++]=new Array("pi","被","批","否","皮","罢","坏","屁","匹","疲","披","脾","辟","劈","啤","僻","譬","丕","仳","噼","圮","坯","埤","媲","庀","擗","枇","毗","淠","濞","琵","甓","疋","痞","痦","癖","睥","砒","篦","纰","罴","芘","苤","萆","蕃","薜","蚌","蚍","蜱","螵","裨","貔","邳","郫","鄱","铍","陂","陴","霹","鲏","鼙");
pArr[j++]=new Array("pia","便","片","票","篇","偏","飘","骗","漂","朴","扁");
pArr[j++]=new Array("pian","便","片","篇","偏","骗","扁","犏","缏","翩","胼","蝙","褊","谝","蹁","骈");
pArr[j++]=new Array("piao","票","飘","漂","朴","剽","剽","嘌","嫖","殍","瓢","瞟","瞟","缥","膘","莩","螵","骠","髟");
pArr[j++]=new Array("pie","撇","氕","瘪","瞥","苤");
pArr[j++]=new Array("pin","品","贫","聘","频","拼","拚","姘","嫔","榀","泵","牝","颦");
pArr[j++]=new Array("ping","平","评","凭","萍","瓶","冯","屏","苹","乒","坪","俜","娉","枰","秤","鲆");
pArr[j++]=new Array("po","破","婆","迫","颇","坡","泊","朴","泼","魄","叵","攴","泺","溥","珀","皤","笸","粕","膊","跛","鄱","酦","钋","钷","陂");
pArr[j++]=new Array("pou","剖","掊","涪","瓿","裒","踣","锫");
pArr[j++]=new Array("pu","普","暴","扑","铺","谱","仆","堡","浦","朴","菩","葡","蒲","瀑","匍","噗","圃","埔","攴","曝","氆","溥","濮","璞","脯","苻","莆","蹼","醭","镤","镨");
pArr[j++]=new Array("q","去","起","前","其","全","情","气","却","期","亲");
pArr[j++]=new Array("qi","起","其","气","期","吃","七","器","奇","企","齐","妻","汽","旗","棋","弃","启","骑","岂","枝","欺","戚","契","凄","歧","漆","泣","乞","迄","亓","亟","伎","俟","偈","嘁","圻","屺","岐","崎","憩","挈","杞","柒","栖","桤","槭","欹","汔","淇","琦","琪","甭","畦","畸","碛","祁","祈","祺","稽","綦","绮","缉","耆","脐","芑","芪","荠","萁","萋","葺","蕲","虮","蛴","蜞","讫","赍","趿","蹊","锜","颀","骐","鲯","鳍","麒");
pArr[j++]=new Array("qia","卡","恰","掐","洽","疴","葜","髂","前","强","钱");
pArr[j++]=new Array("qian","前","钱","千","签","潜","牵","浅","迁","乾","遣","欠","歉","谦","纤","铅","谴","嵌","仟","佥","倩","堑","岍","悭","愆","慊","扦","掮","搴","撖","柑","椠","涔","犍","箝","缱","肷","腱","芊","芡","茜","荨","虔","褰","蹇","钎","钤","钳","锓","阡","骞","鹐","黔");
pArr[j++]=new Array("qiang","强","枪","墙","抢","腔","丬","呛","嫱","戕","戗","樯","炝","爿","玱","箐","羌","羟","蔷","蜣","襁","跄","跫","锖","锵","镪","鸧");
pArr[j++]=new Array("qiao","瞧","桥","悄","乔","巧","敲","侨","壳","雀","翘","俏","劁","峤","峭","愀","憔","撬","樵","橇","毳","硗","硝","窍","缲","舄","茭","荞","蕉","诮","谯","跤","跷","醮","锹","鞒","鞘");
pArr[j++]=new Array("qie","且","切","契","窃","怯","伽","唼","妾","惬","慊","挈","沏","沏","渫","砌","箧","脞","茄","蕺","趄","锲");
pArr[j++]=new Array("qin","亲","侵","琴","秦","勤","钦","擒","吣","嗪","噙","寝","嵚","廑","揿","槿","檎","沁","渗","溱","矜","禽","芩","芹","蓁","螓","衾","衿","覃","锓","骎");
pArr[j++]=new Array("qing","情","亲","清","请","青","轻","庆","倾","晴","卿","倩","圊","擎","檠","氢","氰","磬","箐","綮","罄","苘","蜻","謦","顷","鲭","鲸","黥");
pArr[j++]=new Array("qio","穷","琼","穹","筇","芎","苘","茕","蛩","跫","邛");
pArr[j++]=new Array("qion","穷","琼","穹","筇","芎","苘","茕","蛩","跫","邛");
pArr[j++]=new Array("qiong","穷","琼","穹","筇","芎","苘","茕","蛩","跫","邛","銎","鞠");
pArr[j++]=new Array("qiu","求","球","秋","仇","丘","龟","囚","瞅","俅","巯","楸","氽","泅","湫","犰","糗","艽","虬","蚯","蝤","裘","赇","逑","遒","邱","酋","钆","馗","鳅","鹙","鼽");
pArr[j++]=new Array("qu","去","区","取","曲","趣","屈","驱","趋","娶","渠","躯","凵","劬","岖","朐","枸","氍","璩","癯","瞿","磲","祛","絮","苣","蕖","蘧","蛆","蛐","蠼","衢","觑","诎","遽","阒","鞠","鞫","鸲","麴","黢","龋");
pArr[j++]=new Array("qua","全","权","卷","拳","圈","劝","泉","券","悛","桊");
pArr[j++]=new Array("quan","全","权","卷","拳","圈","劝","泉","券","悛","桊","犬","獾","畎","痊","筌","绻","荃","蜷","诠","辁","醛","铨","颧","鬈","鳈");
pArr[j++]=new Array("que","却","确","缺","雀","悫","攉","榷","炔","瘸","舭","芍","觳","郄","阕","阙","鹊");
pArr[j++]=new Array("qun","群","裙","蝽","逡","遁","麇");
pArr[j++]=new Array("r","儿","人","然","日","如","入","任","让","认");
pArr[j++]=new Array("ra","然","让","染","绕","扰","燃","饶","嚷","壤","冉");
pArr[j++]=new Array("ran","然","染","燃","冉","苒","蚺","髯","让","嚷","壤");
pArr[j++]=new Array("rang","让","嚷","壤","攘","瓤","禳","穰");
pArr[j++]=new Array("rao","绕","扰","饶","娆","桡","荛","蛲");
pArr[j++]=new Array("re","若","热","惹","喏","人","儿","任","认","仍","忍");
pArr[j++]=new Array("ren","人","儿","任","认","忍","仁","刃","仞","壬","妊","恁","稔","纫","纴","荏","葚","衽","讱","赁","轫","韧","饪");
pArr[j++]=new Array("reng","仍","扔","穰","艿");
pArr[j++]=new Array("ri","日","驲");
pArr[j++]=new Array("ro","容","肉","荣","蓉","柔","融","揉","绒","熔","溶");
pArr[j++]=new Array("ron","容","荣","蓉","融","绒","熔","溶","冗","嵘","戎");
pArr[j++]=new Array("rong","容","荣","蓉","融","绒","熔","溶","冗","嵘","戎","榕","狨","肜","茸","蝾","镕");
pArr[j++]=new Array("rou","肉","柔","揉","糅","蹂","鞣");
pArr[j++]=new Array("ru","如","入","辱","儒","乳","汝","嚅","孺","洳","溽","濡","缛","茹","蓐","薷","褥","襦","铷","颥");
pArr[j++]=new Array("rua","软","朊","濡","蠕","阮");
pArr[j++]=new Array("ruan","软","朊","濡","蠕","阮");
pArr[j++]=new Array("rui","瑞","锐","枘","睿","芮","蕊","蕤","蚋");
pArr[j++]=new Array("run","润","闰");
pArr[j++]=new Array("ruo","若","弱","偌","箬","芮");
pArr[j++]=new Array("s","是","上","说","时","生","事","手","十","所","三");
pArr[j++]=new Array("sa","萨","撒","洒","仨","卅","檫","脎","趿","钑","飒");
pArr[j++]=new Array("sai","思","赛","塞","噻","腮","蓑","鳃");
pArr[j++]=new Array("san","三","散","伞","叁","毵","糁","馓","丧","桑","嗓");
pArr[j++]=new Array("sang","丧","桑","嗓","搡","磉","颡");
pArr[j++]=new Array("sao","扫","嫂","骚","埽","搔","瘙","缫","缲","臊","鳋");
pArr[j++]=new Array("se","色","塞","瑟","圾","啬","槭","涩","穑","蔷","铯");
pArr[j++]=new Array("sen","森","僧");
pArr[j++]=new Array("seng","僧");
pArr[j++]=new Array("sh","是","上","说","时","生","事","手","十","身","实");
pArr[j++]=new Array("sha","杀","沙","傻","莎","厦","刹","啥","纱","煞","杉","唼","嗄","歃","痧","砂","裟","赊","铩","霎","鲨");
pArr[j++]=new Array("shai","色","晒","筛","酾");
pArr[j++]=new Array("shan","山","单","善","闪","衫","禅","扇","珊","陕","杉","删","剡","埏","姗","嬗","彡","掸","掺","擅","栅","檀","汕","潸","澹","煽","疝","缮","膳","膻","舢","芟","苫","蟮","詹","讪","赡","跚","鄯","钐","骟","髟","鳝","鳣");
pArr[j++]=new Array("shang","上","商","伤","尚","赏","汤","晌","垧","墒","殇","熵","裳","觞");
pArr[j++]=new Array("shao","少","烧","绍","稍","哨","邵","劭","勺","捎","杓","梢","溲","潲","笤","筲","艄","芍","苕","蛸","鞘","韶");
pArr[j++]=new Array("she","社","设","折","射","舍","涉","蛇","拾","摄","舌","佘","厍","奢","慑","揲","歙","滠","猞","畲","睫","蛞","赊","赦","铊","阇","麝");
pArr[j++]=new Array("shei","谁");
pArr[j++]=new Array("shen","身","什","神","深","甚","参","伸","申","审","沈","慎","绅","吲","呻","哂","娠","婶","抻","椹","渖","渗","瘆","矧","砷","肾","胂","莘","葚","蜃","诜","谂","鲹");
pArr[j++]=new Array("sheng","生","声","省","胜","升","圣","乘","盛","剩","牲","绳","嵊","晟","渑","甥","眚","笙");
pArr[j++]=new Array("shi","是","时","事","十","实","什","使","世","市","师","士","式","识","始","史","失","似","石","视","示","势","室","食","诗","试","施","适","释","氏","尸","侍","拾","驶","湿","饰","逝","誓","殖","狮","匙","蚀","仕","嗜","噬","埘","屎","峙","弑","弛","恃","拭","柿","炻","矢","礻","筮","耆","舐","莳","蓍","虱","螫","谥","豉","豕","贳","轼","郝","酾","铈","铊","饣","鲥","鲺","鳀","鸤");
pArr[j++]=new Array("sho","手","受","收","首","授","守","熟","售","瘦","寿");
pArr[j++]=new Array("shou","手","受","收","首","授","守","熟","售","瘦","寿","兽","狩","绶","艏");
pArr[j++]=new Array("shu","书","数","术","树","属","输","熟","述","束","叔","舒","殊","署","鼠","疏","俞","竖","暑","抒","梳","蔬","淑","枢","倏","塾","墅","姝","孰","庶","恕","戍","摅","曙","杼","樗","殳","毹","沭","涑","漱","澍","疋","秫","纾","腧","荼","菽","薯","蜀","蜍","赎","黍");
pArr[j++]=new Array("shua","刷","耍","唰","涮","双","率","摔","爽","衰","帅");
pArr[j++]=new Array("shuai","率","摔","衰","帅","甩","缞","蟀");
pArr[j++]=new Array("shuan","拴","揎","栓","汕","涮","踹","闩","双","爽","霜");
pArr[j++]=new Array("shuang","双","爽","霜","孀","泷","淙","骦","鹴");
pArr[j++]=new Array("shui","说","水","谁","睡","税","蜕");
pArr[j++]=new Array("shun","顺","瞬","吮","舜");
pArr[j++]=new Array("shuo","说","数","硕","烁","妁","搠","朔","杓","槊","溯","濯","芍","蒴","铄");
pArr[j++]=new Array("si","四","死","司","思","似","斯","食","丝","私","寺","撕","厕","肆","伺","俟","兕","厮","厶","咝","嗣","嘶","姒","巳","汜","泗","澌","祀","祠","笥","糸","纟","缌","耜","肄","苡","菥","蛳","锶","雉","飔","饲","饴","驷","鸶");
pArr[j++]=new Array("so","送","松","宋","搜","颂","嵩","艘","耸","诵","讼");
pArr[j++]=new Array("son","送","松","宋","颂","嵩","耸","诵","讼","凇","崧");
pArr[j++]=new Array("song","送","松","宋","颂","嵩","耸","诵","讼","凇","崧","忪","怂","悚","淞","竦","菘","锶");
pArr[j++]=new Array("sou","搜","艘","叟","嗖","嗽","嗾","擞","涑","溲","漱","瞍","薮","螋","锼","飕","馊");
pArr[j++]=new Array("su","苏","诉","速","素","俗","宿","肃","稣","塑","僳","嗉","夙","愫","涑","溯","簌","粟","蓿","蔌","觫","谡","酥","骕","鹔");
pArr[j++]=new Array("sua","算","酸","狻","蒜");
pArr[j++]=new Array("suan","算","酸","狻","蒜");
pArr[j++]=new Array("sui","虽","随","岁","碎","尿","遂","彗","攵","濉","燧","眭","睢","祟","穗","绥","荽","蓑","谇","邃","隋","隧","髓");
pArr[j++]=new Array("sun","孙","损","榫","狲","笋","荪","跣","隼","飧");
pArr[j++]=new Array("suo","所","索","缩","锁","莎","嗦","唆","唢","嗍","娑","挲","桫","梭","琐","睃","羧","蓑","逡");
pArr[j++]=new Array("t","他","她","天","头","同","听","太","体","通","提");
pArr[j++]=new Array("ta","他","她","它","达","踏","塔","拓","塌","嗒","挞","榻","沓","溻","漯","獭","趿","跶","蹋","遢","铊","闼","阘","鳎");
pArr[j++]=new Array("tai","太","台","态","抬","泰","胎","汰","炱","肽","苔","薹","跆","邰","酞","钛","骀","鲐");
pArr[j++]=new Array("tan","谈","弹","探","叹","坦","坛","贪","摊","滩","谭","潭","毯","炭","啴","坍","忐","昙","檀","湛","澹","痰","瘫","眈","碳","膻","舔","荨","蕈","袒","覃","赕","郯","钽","锬","镡");
pArr[j++]=new Array("tang","堂","唐","倘","躺","汤","糖","趟","塘","烫","膛","淌","傥","帑","惝","搪","棠","樘","溏","瑭","羰","耥","螗","螳","醣","铴","镋","镗");
pArr[j++]=new Array("tao","讨","套","逃","挑","桃","涛","陶","掏","萄","淘","滔","叨","啕","梼","洮","焘","绦","绹","韬","饕","鼗");
pArr[j++]=new Array("te","特","忑","忒","慝","铽","腾","疼","藤","滕","誊");
pArr[j++]=new Array("ten","腾","疼","藤","滕","誊");
pArr[j++]=new Array("teng","腾","疼","藤","滕","誊");
pArr[j++]=new Array("ti","体","提","题","弟","替","踢","梯","倜","剃","剔","啼","嚏","屉","悌","惕","棣","涕","睇","绨","缇","荑","裼","谛","蹄","逖","醍","锑","鳀","鹈");
pArr[j++]=new Array("tia","天","条","调","田","跳","挑","甜","添","填","佃");
pArr[j++]=new Array("tian","天","田","甜","添","填","佃","嗔","忝","恬","掭","栝","殄","滇","町","畋","腆","舔","苫","蚕","蚺","觍","钿","锘","阗","颋");
pArr[j++]=new Array("tiao","条","调","跳","挑","佻","眺","祧","稠","窕","笤","粜","苕","蜩","踔","迢","铫","髫","鲦","龆");
pArr[j++]=new Array("tie","铁","贴","帖","帖","揲","萜","锇","餮");
pArr[j++]=new Array("tin","听","停","庭","厅","挺","亭","廷","艇","婷","梃");
pArr[j++]=new Array("ting","听","停","庭","厅","挺","亭","廷","艇","婷","梃","汀","烃","町","耵","莛","葶","蜓","铤","霆","颋");
pArr[j++]=new Array("to","头","同","通","统","投","痛","童","透","偷","铜");
pArr[j++]=new Array("ton","同","通","统","痛","童","铜","桐","桶","筒","仝");
pArr[j++]=new Array("tong","同","通","统","痛","童","铜","桐","桶","筒","仝","佟","侗","侗","僮","嗵","垌","峒","彤","恫","恸","捅","潼","瞳","砼","硐","艟","茼","酮","鲖");
pArr[j++]=new Array("tou","头","投","透","偷","钭","骰");
pArr[j++]=new Array("tu","突","土","图","徒","途","吐","涂","屠","秃","兔","凸","堍","芏","荼","菟","酴","钍");
pArr[j++]=new Array("tua","团","彖","抟","揣","湍","疃","鹑");
pArr[j++]=new Array("tuan","团","彖","抟","揣","湍","疃","鹑");
pArr[j++]=new Array("tui","推","退","腿","煺","萑","褪","颓");
pArr[j++]=new Array("tun","吞","屯","囤","暾","氽","沌","炖","窀","肫","臀","褪","豚","饨","鲀");
pArr[j++]=new Array("tuo","他","脱","托","拖","妥","拓","陀","魄","乇","佗","佗","唾","坨","庹","捝","摭","柁","柝","棁","椭","橐","沱","沲","砣","箨","绥","讬","跎","迤","酏","酡","铊","隋","饦","驮","驼","鸵","鼍");
pArr[j++]=new Array("w","我","为","文","无","外","问","位","五","万","王");
pArr[j++]=new Array("wa","瓦","娃","挖","哇","佤","凹","娲","洼","腽","蛙","袜","鲑");
pArr[j++]=new Array("wai","外","歪","呙","夭");
pArr[j++]=new Array("wan","万","完","晚","湾","玩","碗","弯","腕","顽","挽","婉","宛","丸","剜","娩","惋","浣","烷","琬","畹","皖","箢","纨","绾","脘","芄","莞","菀","蔓","蜿","豌","鞔","鲩");
pArr[j++]=new Array("wang","王","望","往","网","忘","亡","汪","妄","旺","枉","芒","尢","惘","罔","辋","魍");
pArr[j++]=new Array("we","为","文","问","位","未","委","微","闻","卫","韦");
pArr[j++]=new Array("wei","为","位","未","委","微","卫","韦","围","威","维","味","遗","伟","危","谓","唯","慰","尾","违","魏","喂","伪","畏","胃","惟","倭","偎","囗","圩","娓","尉","崴","嵬","巍","帏","帷","桅","沩","洧","涠","渭","潍","炜","煨","熨","猗","猥","猬","玮","痿","眭","硙","纬","艉","芟","苇","荽","萎","葳","蔚","薇","诿","軎","逶","闱","阢","隈","隗","隹","韪","鲔","鳂","鳚");
pArr[j++]=new Array("wen","文","问","闻","温","稳","吻","纹","刎","愠","揾","殁","汶","煴","玟","珉","璺","瘟","笏","紊","缊","蕰","蚊","辒","阌","雯","鳁");
pArr[j++]=new Array("weng","翁","嗡","瓮","蓊","蕹","鹟");
pArr[j++]=new Array("wo","我","握","窝","卧","沃","倭","喔","夭","幄","挝","斡","涡","瘟","硪","肟","莴","蜗","龌");
pArr[j++]=new Array("wou","渥");
pArr[j++]=new Array("wu","无","五","务","物","武","恶","屋","吴","午","舞","误","污","乌","伍","於","悟","雾","吾","呜","勿","侮","兀","捂","仵","唔","圬","坞","垭","妩","婺","寤","巫","庑","忤","怃","悮","戊","晤","杌","梧","毋","浯","渥","焐","牾","痦","瞀","笏","芜","芴","蜈","蝥","诬","迕","邬","鋈","钨","铻","阢","骛","鹀","鹉","鼯");
pArr[j++]=new Array("x","下","学","小","心","想","行","见","现","些","向");
pArr[j++]=new Array("xi","西","系","息","喜","希","席","细","习","吸","戏","洗","惜","析","悉","稀","袭","熙","嘻","夕","牺","锡","膝","撕","溪","昔","腊","媳","晰","粞","隙","熄","僖","兮","唏","嘶","奚","嬉","屃","屎","屣","嵇","徙","戯","曦","栖","樨","檄","欷","歙","汐","浠","淅","澌","烯","熹","犀","玺","畦","皙","矽","硒","禊","禧","穸","绤","羲","翕","舄","舾","茜","菥","葸","蓰","蜥","蜴","螅","蟋","裼","褶","觋","诶","蹊","郄","郗","酾","醯","钖","铣","阋","饩","鳃","鳛","鼷");
pArr[j++]=new Array("xia","下","夏","吓","侠","霞","峡","瞎","厦","狭","暇","虾","匣","呷","挟","柙","歃","毳","洽","狎","瑕","瘕","硖","罅","葭","辖","遐","黠");
pArr[j++]=new Array("xian","见","现","先","显","线","险","限","县","鲜","献","洗","仙","闲","陷","贤","宪","洒","嫌","掀","纤","羡","弦","衔","伣","冼","咸","娴","岘","崄","彡","挦","掺","暹","氙","涎","濂","燹","狝","猃","痃","痫","癣","碱","祆","筅","籼","腺","舷","苋","莶","藓","蚬","跣","跹","酰","钐","铣","铦","锨","锬","霰","馅","鹇","黹");
pArr[j++]=new Array("xiang","想","向","相","象","像","香","响","项","乡","降","享","箱","详","祥","襄","湘","巷","厢","翔","镶","橡","庠","攘","缃","舡","芗","葙","蟓","飨","饷","骧","鲞");
pArr[j++]=new Array("xiao","小","笑","校","消","效","销","晓","萧","肖","削","潇","孝","啸","宵","哓","哮","嚣","姣","枭","枵","梢","淆","爻","狡","硝","筱","箫","绡","芍","茭","蛸","蟏","逍","酵","霄","骁","魈","鸮");
pArr[j++]=new Array("xie","些","解","写","血","谢","叶","协","鞋","斜","邪","胁","携","泄","歇","械","屑","谐","卸","泻","亵","偕","勰","廨","懈","挟","撷","桔","楔","榍","榭","歙","渫","溉","瀣","燮","獬","眭","绁","缬","苴","薤","蝎","蟹","跬","躞","迦","邂","隰","颉","骱","鲑");
pArr[j++]=new Array("xin","心","新","信","寻","辛","欣","芯","薪","馨","囟","忻","昕","歆","莘","衅","鑫","锌","镡","骍");
pArr[j++]=new Array("xing","行","性","形","兴","星","省","姓","型","幸","醒","刑","腥","杏","悻","惺","擤","猩","硎","荇","邢","钘","铏","陉","饧");
pArr[j++]=new Array("xio","兄","雄","胸","凶","熊","汹","匈","芎","讻","诇");
pArr[j++]=new Array("xion","兄","雄","胸","凶","熊","汹","匈","芎","讻","诇");
pArr[j++]=new Array("xiong","兄","雄","胸","凶","熊","汹","匈","芎","讻","诇");
pArr[j++]=new Array("xiu","修","秀","休","袖","宿","臭","羞","绣","朽","咻","嗅","岫","庥","溴","煦","莠","貅","锈","馐","髹","鸺");
pArr[j++]=new Array("xu","许","需","续","须","虚","徐","序","绪","蓄","吁","叙","畜","婿","勖","咻","嘘","圩","墟","屿","恤","戌","旭","旮","旯","栩","洫","溆","煦","盱","砉","糈","絮","肷","胥","芋","蓿","诩","谞","酗","醑","雩","顼","馘");
pArr[j++]=new Array("xua","选","宣","玄","旋","悬","券","喧","儇","埙","揎");
pArr[j++]=new Array("xuan","选","宣","玄","旋","悬","券","喧","儇","埙","揎","擐","暄","楦","泫","洵","涓","渲","漩","炫","煊","璇","癣","眩","碹","绚","萱","谖","轩","铉","镟","馔");
pArr[j++]=new Array("xue","学","血","雪","穴","削","薛","噱","泶","炔","谑","踅","靴","鳕","鸴");
pArr[j++]=new Array("xun","寻","讯","训","迅","询","巡","逊","循","旬","勋","埙","孙","峋","巽","徇","恂","挦","曛","梭","殉","汛","洵","浔","浚","熏","狻","獯","窨","荀","荤","荨","蕈","薰","逡","遁","郇","醺","鑫","驯","鲟");
pArr[j++]=new Array("y","一","有","也","要","以","么","于","用","又","已");
pArr[j++]=new Array("ya","亚","压","呀","牙","雅","押","哑","崖","涯","丫","鸭","讶","鸦","伢","垭","娅","岈","挜","揠","柙","桠","氩","琊","疋","痖","睚","砑","碣","芽","蚜","衙","轧","辂","迓","铔");
pArr[j++]=new Array("yai","睚");
pArr[j++]=new Array("yan","眼","言","研","广","严","演","验","烟","燕","延","沿","颜","殷","掩","厌","岩","咽","炎","艳","盐","宴","嫣","雁","焰","淹","焉","彦","俨","偃","兖","剡","厣","唁","埏","堰","奄","妍","崦","恹","晏","檐","氤","洇","涎","湮","滟","焱","琰","砚","硎","筵","罨","胭","腌","芫","菸","蔫","蜒","衍","覃","觃","讠","谚","谳","赝","趼","郾","鄢","酽","闫","阉","阎","阏","阽","餍","魇","鹌","黡","鼹");
pArr[j++]=new Array("yang","样","阳","杨","央","养","洋","扬","羊","仰","痒","佯","徉","怏","恙","旸","殃","氧","泱","漾","炀","烊","玚","疡","秧","蛘","鞅","飏","鸯");
pArr[j++]=new Array("yao","要","么","约","药","摇","腰","遥","咬","耀","邀","姚","哟","妖","窑","谣","吆","夭","尧","峣","崤","崾","幺","徭","徼","曜","杳","洮","淆","瀹","爻","珧","瑶","疟","祆","窈","窕","繇","肴","舀","荛","轺","钥","铫","飖","鳐","鹞");
pArr[j++]=new Array("ye","也","业","夜","爷","叶","野","耶","页","邪","咽","液","冶","噎","拽","掖","揲","揶","晔","曳","椰","洇","烨","琊","腋","荼","谒","邺","铘","靥","馌");
pArr[j++]=new Array("yi","一","以","已","意","义","议","衣","易","医","依","异","艺","亿","疑","益","移","遗","仪","亦","忆","译","伊","宜","尾","蛇","椅","谊","翼","艾","泄","役","抑","姨","毅","逸","夷","裔","倚","溢","矣","乙","疫","仡","佗","佚","佾","刈","劓","勚","呓","咦","咿","嗌","噫","圯","埸","壹","奕","屹","峄","嶷","弈","弋","彝","怡","怿","悒","懿","挹","掖","揖","旖","昱","曳","欹","殪","洫","渫","漪","焱","熠","犄","猗","疙","痍","瘗","癔","眙","硪","祎","绁","绎","缢","羿","翊","翌","翳","肄","胰","腋","臆","舣","芸","苡","荑","薏","蚁","蛾","蜴","袂","诒","诣","贻","轶","迤","邑","酏","钇","铱","锜","镒","镱","阝","雉","颐","饴","饻","驿","鹝","鹢","鹥","黝","黟");
pArr[j++]=new Array("yin","因","音","引","印","银","烟","隐","阴","饮","殷","吟","姻","淫","尹","荫","吲","喑","圻","垠","堙","夤","寅","廴","氤","沂","洇","湮","狺","瘾","窨","纼","胤","芩","茚","茵","蚓","訚","鄞","铟","霪","骃","鳏","龂","龈");
pArr[j++]=new Array("ying","应","英","影","营","迎","硬","映","盈","赢","鹰","婴","颖","嘤","媵","嬴","撄","楹","樱","滢","潆","瀛","瑛","璎","瘿","绬","缨","罂","膺","茔","荥","荧","莹","莺","萤","萦","蓥","蝇","逞","郢","锳","颍","颕","鹦");
pArr[j++]=new Array("yo","育","哟","唷","有","用","又","由","友","游","右");
pArr[j++]=new Array("yon","用","永","拥","勇","涌","庸","泳","佣","俑","咏");
pArr[j++]=new Array("yong","用","永","拥","勇","涌","庸","泳","佣","俑","咏","喁","墉","壅","恿","慵","甬","痈","臃","臾","蕹","蛹","踊","邕","镛","雍","颙","饔","鲬","鳙");
pArr[j++]=new Array("you","有","又","由","友","游","右","优","油","邮","犹","尤","忧","幽","幼","悠","诱","佑","侑","卣","呦","囿","宥","尢","揄","攸","柚","泅","牖","猷","疣","繇","聱","莜","莠","莸","蚰","蚴","蝣","蝤","酉","釉","铀","铕","鱿","鲉","黝","鼬");
pArr[j++]=new Array("yu","于","与","语","育","余","遇","雨","玉","预","鱼","欲","域","誉","予","狱","愈","於","宇","御","郁","豫","渔","吁","愚","俞","愉","羽","寓","浴","裕","娱","舆","喻","粥","伛","俣","喁","噢","圄","圉","圩","妤","妪","尉","屿","峪","嵛","庾","揄","昱","梧","榆","欤","毓","毹","汩","淤","渝","滪","煜","煨","熨","燠","狳","瑜","畲","瘀","瘐","盂","禹","禺","窬","窳","竽","纡","聿","肀","腧","腴","臾","舁","芋","菸","萸","蓣","蔚","虞","蜍","蜮","蝓","衙","衙","觎","谀","谕","迂","逾","钰","铻","阈","阏","隅","雩","饫","馀","驭","鬻","鹆","鹬","龉");
pArr[j++]=new Array("yua","员","原","元","远","院","愿","园","源","圆","袁");
pArr[j++]=new Array("yuan","员","原","元","远","院","愿","园","源","圆","袁","缘","怨","援","冤","宛","渊","圜","垣","塬","媛","掾","橼","沅","涓","爰","猿","瑗","畹","眢","箢","芫","苑","菀","螈","贠","辕","阮","陨","鸢","鸳","鹓","鼋");
pArr[j++]=new Array("yue","月","越","乐","约","跃","阅","岳","曰","悦","刖","哕","栎","樾","瀹","粤","蠖","钥","钺","龠");
pArr[j++]=new Array("yun","运","云","允","晕","韵","孕","匀","蕴","恽","愠","昀","榅","殒","氲","煴","熨","狁","瘟","筠","筼","纭","缊","耘","芸","苑","菀","蕰","贠","赟","郓","郧","酝","陨","韫");
pArr[j++]=new Array("z","在","这","中","子","自","着","之","只","作","主");
pArr[j++]=new Array("za","杂","扎","砸","咋","匝","咂","唼","拶","籴","鲝");
pArr[j++]=new Array("zai","在","再","载","灾","仔","宰","哉","崽","栽","甾");
pArr[j++]=new Array("zan","咱","赞","暂","拶","攒","昝","涔","湔","瓒","簪","糌","臜","趱","酂","錾");
pArr[j++]=new Array("zang","藏","脏","葬","奘","臜","臧","赃","驵");
pArr[j++]=new Array("zao","早","造","遭","糟","躁","灶","燥","噪","凿","唣","枣","槽","澡","皂","窖","缫","缲","藻","蚤");
pArr[j++]=new Array("ze","则","泽","责","择","咋","仄","啧","帻","昃","柞","稷","窄","笮","箦","舴","赜","迮","鲗");
pArr[j++]=new Array("zei","贼");
pArr[j++]=new Array("zen","怎","谮","曾","增","综","赠","憎","甑","缯","罾");
pArr[j++]=new Array("zeng","曾","增","综","赠","憎","甑","缯","罾","锃");
pArr[j++]=new Array("zh","这","中","着","之","只","主","长","知","种","者");
pArr[j++]=new Array("zha","查","扎","炸","诈","眨","咋","乍","吒","咤","哳","喋","喳","揸","札","柞","栅","楂","榨","槎","渣","渫","猹","痄","砟","碴","笮","苴","蚱","轧","铡","闸","鲊","齄");
pArr[j++]=new Array("zhai","摘","齐","择","侧","债","宅","寨","斋","疵","瘵","砦","窄","翟","膪");
pArr[j++]=new Array("zhan","战","展","站","占","颤","斩","沾","粘","崭","搌","旃","栈","毡","湔","湛","澶","盏","瞻","绽","蘸","袒","觇","詹","谵","躔","辗","醮","飐","骣","鳣","鹯","黏");
pArr[j++]=new Array("zhang","长","张","掌","章","丈","帐","仗","障","涨","杖","胀","账","彰","仉","嫜","嶂","幛","樟","漳","獐","璋","瘴","绱","蟑","鄣");
pArr[j++]=new Array("zhao","着","找","照","招","著","朝","赵","召","兆","罩","昭","爪","啁","搔","棹","沼","淖","濯","笊","肇","蚤","诏","钊","鸼");
pArr[j++]=new Array("zhe","这","着","者","著","折","哲","浙","遮","乇","慑","摺","柘","磔","耷","聂","蔗","蛰","蜇","螫","褚","褶","谪","赭","辄","辙","锗","陬","鹧");
pArr[j++]=new Array("zhei","这");
pArr[j++]=new Array("zhen","真","阵","镇","震","针","珍","振","圳","诊","侦","贞","枕","斟","朕","椹","榛","浈","溱","滇","甄","畛","疹","砧","稹","箴","纼","缜","胗","臻","蓁","赈","轸","鸩");
pArr[j++]=new Array("zheng","正","政","争","证","整","征","丁","郑","挣","睁","怔","症","蒸","峥","帧","徵","拯","桢","狰","町","瞠","祯","筝","诤","钲","铮","锃","鲭");
pArr[j++]=new Array("zhi","之","只","知","制","至","直","指","治","识","志","支","职","质","致","止","值","织","纸","置","智","执","址","氏","迟","枝","植","旨","掷","殖","芷","芝","侄","秩","肢","滞","汁","脂","稚","帜","卮","吱","咫","埴","夂","峙","帙","彘","徵","忮","挚","摭","昵","枳","枳","栀","栉","桎","氐","炙","痔","痣","砥","祁","祉","祗","窒","絷","耆","胝","膣","蛭","蛰","蜘","觯","豸","贽","趵","趾","跖","踬","踯","轵","轾","郅","郦","酯","铚","锧","陟","雉","骘","鸱","鸷","黹");
pArr[j++]=new Array("zho","中","种","重","周","众","终","州","钟","洲","忠");
pArr[j++]=new Array("zhon","中","种","重","众","终","钟","忠","仲","衷","肿");
pArr[j++]=new Array("zhong","中","种","重","众","终","钟","忠","仲","衷","肿","冢","忪","潼","盅","舂","舯","蚣","螽","踵","锺");
pArr[j++]=new Array("zhou","周","州","洲","舟","皱","宙","骤","粥","轴","昼","咒","啁","啄","妯","帚","碡","籀","繇","纣","绉","肘","胄","舳","荮","诌","诪","赒","辀","酎","驺","鬻","鲖","鸼");
pArr[j++]=new Array("zhu","主","住","术","注","著","助","属","朱","诸","逐","竹","珠","驻","猪","筑","祝","柱","烛","嘱","煮","株","铸","蛛","伫","侏","妯","拄","杼","柚","楮","槠","橥","泞","洙","渚","潴","澍","炷","疰","瘃","瞩","竺","纻","翥","舳","苎","苧","茁","茱","蚰","蛀","褚","诛","贮","邾","铢","鬻","麈");
pArr[j++]=new Array("zhua","抓","爪","挝","传","转","专","装","状","庄","撞");
pArr[j++]=new Array("zhuai","转","拽");
pArr[j++]=new Array("zhuan","传","转","专","赚","砖","撰","啭","抟","沌","湍","篆","颛","馔");
pArr[j++]=new Array("zhuang","装","状","庄","撞","壮","妆","桩","幢","僮","奘","戆","艟");
pArr[j++]=new Array("zhui","追","坠","惴","揣","椎","槌","缀","缒","萑","赘","锥","隧","隹","骓");
pArr[j++]=new Array("zhun","准","盹","窀","肫","胗","谆","隼");
pArr[j++]=new Array("zhuo","着","著","桌","捉","卓","缴","琢","倬","勺","啄","拙","擢","斫","棁","棹","浊","浞","涿","淖","濯","灼","焯","禚","箸","绌","肫","茁","蕞","诼","趵","踔","躅","酌","镯");
pArr[j++]=new Array("zi","子","自","字","资","齐","紫","姊","姿","仔","滋","咨","兹","吱","呲","孜","孳","嵫","恣","梓","淄","渍","滓","甾","疵","瘠","眦","秭","笫","籽","粢","糍","缁","耔","茈","觜","訾","谘","赀","趑","辎","锱","镃","髭","鲻","鹚","龇");
pArr[j++]=new Array("zo","走","总","宗","纵","奏","踪","综","偬","揍","枞");
pArr[j++]=new Array("zon","总","宗","纵","踪","综","偬","枞","棕","疭","粽");
pArr[j++]=new Array("zong","总","宗","纵","踪","综","偬","枞","棕","疭","粽","腙","骔","鬃");
pArr[j++]=new Array("zou","走","奏","揍","楱","诌","诹","邹","鄹","陬","驺","鲰");
pArr[j++]=new Array("zu","组","足","族","祖","阻","租","俎","卒","咀","沮","淬","苴","菹","诅","蹴","镞","驵");
pArr[j++]=new Array("zua","钻","赚","攥","纂","缵","躜");
pArr[j++]=new Array("zuan","钻","赚","攥","纂","缵","躜");
pArr[j++]=new Array("zui","最","罪","嘴","堆","醉","羧","蕞","觜");
pArr[j++]=new Array("zun","尊","遵","撙","樽","鳟");
pArr[j++]=new Array("zuo","作","做","坐","左","座","昨","佐","琢","乍","凿","唑","嘬","怍","撮","柞","砟","祚","笮","胙","迮","酢","阼");


var langFlag=1;//中英文切换标志
var keyFlag=0;//大小写的切换标志

var page=1;//汉字的当前页
var pages=1;//对应汉字的总页数

var objInput = document.getElementById('myInput');//显示全部字符的控件
var chInput=document.getElementById("ch_str");//显示拼音字符的控件
var choice=document.getElementById('choice');
var choiceWrapper=document.getElementById("choiceWrapper");
var keyboard = document.getElementById('keyboard');//整个键盘
var max_length = 20;//最大长度
var input_type = 'all';//输入类型
var upper_lower = 'all';
var max_num = 0;

function showKeyboard(obj, maxLength, inputType, maxNum)
{
	keyboard.style.display = 'block';
	to_obj = obj;	
	max_length = maxLength;
	input_type = inputType;
	max_num = maxNum;
	
	//upgrade by xcz 2012.05.03
	//document.getElementById("myInput").value = '';
	objInput.type = obj.type;
	objInput.value = obj.value;	
	
	objInput.focus(); 
	//changeToLowerUpper();
	//chinaToEnglish();
	//preNextShow();
}
function input(num){	
	if(langFlag==0)//中文输入状态下的处理
	{			
		if(/^[a-z]+$/.test(num))//如果输入的是小写字母
		{
			if(chInput.value.length<6)
			{
				TT.add(chInput,num);
			}
		}
		else if(/^[1-5]+$/.test(num)&&choice.innerHTML!="")//当汉字列表不为空时，输入数字代表选字符号
		{		
			var myHtml=choice.innerText;						
			var myHtml=myHtml.slice((page-1)*5*5);
			if(myHtml.indexOf(num)!=-1)
			{				
				var loc=myHtml.indexOf(num);
				var myText=myHtml.substring(loc+2,loc+3);
				set(escape(myText));
			}	
		}
		else if((/^[0||6||7||8||9||?||,||.||？||，||。]+$/.test(num)||keyFlag==1)&&choice.innerHTML!="")
		{
			TT.add(objInput,chInput.value+num);
			chInput.value="";
			choice.innerHTML="";
			choice.style.left=0+"px";
			choiceWrapper.style.display="none";	
		}			
		else
		{						
			TT.add(objInput,num);		
		}											
	}
	else if(langFlag==1)//英文输入状态下的处理
	{	  		
		TT.add(objInput,num);
	}  
   objInput.focus(); //重新获得焦点以触发get()函数
}

function dash(num){	//特殊字符的处理
	num = String.fromCharCode(num);
	TT.add(objInput,num);	
}

function get(){	
	if(langFlag==0)
	{
		var c_val=chInput.value;		
		if(!c_val)
		{
			choice.innerHTML="";			
			choiceWrapper.style.display="none";		
		}	
		else
		{	
			var str=c_val;
			if(str.charAt(0)=='u'||str.charAt(0)=='v'||str.charAt(0)=='i'){TT.del(chInput,1);choice.innerHTML="";return;} 
			str=str.replace(/v/gi,"u`"); 
			for(k=pArr.length-1;k>=0;k--){ 
				if(pArr[k][0]<=str)break; //通过字符串比较，变化到该数组第一位小于等于当前字符串时，指针停止
			} 
			if(k<0)return; 
			var str="";		
			var fig=1;
			page=1;
			pages=Math.ceil((pArr[k].length-1)/5);		
			for(var m=1;m<pArr[k].length;m++)
			{		
				if(fig>5){fig=1;}			
				str+="<a href='#' onclick=\"set('"+escape(pArr[k][m])+"')\">"+fig+"."+pArr[k][m]+"</a>" //对字符进行unicode编码
				fig=fig+1;				
			}				
			//choice.innerHTML=str+"...";
			choice.innerHTML=str;			
			choiceWrapper.style.display="block";	
			choice.style.left=0+"px";
			preNextShow();						
		}
	}
	/* 这些代码只能在IE执行
	var   e   =   event.srcElement; 
	var   r   =   event.srcElement.createTextRange(); 
	r.moveStart( 'character',e.value.length); 
	r.collapse(true); //表示光标移动到开头
	r.select(); //显示光标*/
} 

function set(txt_v){				
	var c_start=TT.getCursorPosition(objInput);	
	objInput.value=objInput.value.slice(0,c_start) + unescape(txt_v) + objInput.value.slice(c_start, objInput.value.length);
	TT.setCursorPosition(objInput,c_start+1);
	
	chInput.value="";
	choice.innerHTML="";
	choice.style.left=0+"px";
	choiceWrapper.style.display="none";
}

function backSpaceKey(){	
	if(langFlag==0&&choice.innerHTML!=""&&chInput.value!="")//当汉字列表不为空时的删除处理
	{		
		TT.del(chInput,1);					
	}
	else
	{
		TT.del(objInput,1);
	}
	objInput.focus();	
}

function chinaToEnglish(){	
	if(langFlag==0)
	{
		if(choice.innerHTML!="")//当中文状态并且未从字列表中选择字，而切换到英文键后的处理
		{
			TT.add(objInput,chInput.value);
			chInput.value="";
			choice.innerHTML="";
			choice.style.left=0+"px";
			choiceWrapper.style.display="none";		
		}
		document.getElementById('key_langu').className="en_langu";
		document.getElementById('key_question_mark').value="?";
		document.getElementById('key_comma').value=",";
		document.getElementById('key_full_stop').value=".";		
		langFlag=1;
	}
	else
	{
		document.getElementById('key_langu').className="ch_langu";
		document.getElementById('key_question_mark').value="？";
		document.getElementById('key_comma').value="，";
		document.getElementById('key_full_stop').value="。";
		langFlag=0;
	}
	objInput.focus();
}
function changeToLowerUpper(){		
	var change_left = document.getElementById('key_lower_left'); 
	var keys = document.getElementById('showKeyboard').getElementsByTagName('input');    
    if(keyFlag == 1){ 	
		change_left.className = 'lowerCase';	
        for(i=0; i<keys.length; i++)
        {
            keys.item(i).value = keys.item(i).value.toLowerCase();
        }
		keyFlag=0;
    }
    else if(keyFlag == 0)
    { 	
		change_left.className = 'capitalization';
        for(i=0; i<keys.length; i++)
        {
            keys.item(i).value = keys.item(i).value.toUpperCase();
        }
		choice.innerHTML="";		
		choiceWrapper.style.display="none";	
		keyFlag=1;
    }	
	objInput.focus();
}
function nextPage(){
	if(page<pages)
	{
	page++;
	choice.style.left=-885*(page-1)+"px";
	}
	preNextShow();
}
function prePage(){
	if(page>1)
	{
		page--;
		choice.style.left=-885*(page-1)+"px";	
	}
	preNextShow();
}
function preNextShow(){
	document.getElementById("prePage").className=(page>1)?"prePage":"prePage gray";
	document.getElementById("nextPage").className=(page<pages)?"nextPage":"nextPage gray";
}


function closeKeyboard(){   
	chInput.value="";	
	document.getElementById("keyboard").style.display="none";
	document.getElementById("choice").innerHTML="";
	document.getElementById("choice").style.left=0+"px";
	document.getElementById("choiceWrapper").style.display="none";
}
function key_submit(){	
	//alert(to_obj.value);
	var myInputValue = document.getElementById("myInput").value;
	//if(myInputValue.replace(/(^\s*|(\s*$))/g,"")!= ''){
		to_obj.value=document.getElementById("myInput").value;
	//}
	to_obj.focus();
	document.getElementById('keyboard').style.display = 'none'; 
}

// <![CDATA[
var TT = {
	/* 获取光标位置*/
	getCursorPosition: function(t){
	if (document.selection) {
		t.focus();
		var ds = document.selection;
		var range = ds.createRange();
		var stored_range = range.duplicate();
		stored_range.moveToElementText(t);
		stored_range.setEndPoint("EndToEnd", range);
		t.selectionStart = stored_range.text.length - range.text.length;
		t.selectionEnd = t.selectionStart + range.text.length;
		return t.selectionStart;
	} else return t.selectionStart
	},
	
	/* 设置光标位置 */
	setCursorPosition:function(t, p){
	this.sel(t,p,p);
	},
	
	/* 在光标后面增加字符	*/
	add:function (t, txt){
	var val = t.value;
	var words = 'qwertyuiopasdfghjklzxcvbnm';
	var num   = '1234567890';
	
	/*xu added 9.16.2013*/
	var selectStart = this.getCursorPosition(t); //xu added 9.16.2013
	if(parseInt(max_length,10) > 0 && val.length>=max_length){
		selectStart = selectStart - txt.length;
	}
	
	if(parseInt(max_length,10) > 0){
		if(val.length<max_length)
		{
			if(input_type == 'all')
			{
				//alert('A: ' + this.getCursorPosition(t));
				t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
				//alert('B: ' + this.getCursorPosition(t));
				
			}
			else if(input_type == 'word' && words.indexOf(txt) != -1)
			{
				t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
				
			}
			else if(input_type == 'num' && num.indexOf(txt) != -1)
			{
				val = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
				if(parseInt(max_num,10) > 0)
				{
					if(parseInt(val,10) <= parseInt(max_num,10))
					{
						t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
					}
				}else{
					t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
					
				}			
			}
			else
			{
			}
		}
	}else{
		if(input_type == 'all')
		{
			t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
			
		}
		else if(input_type == 'word' && words.indexOf(txt) != -1)
		{
			t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
			
		}
		else if(input_type == 'num' && num.indexOf(txt) != -1)
		{
			val = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
			if(parseInt(max_num,10) > 0)
			{
				if(parseInt(val,10) <= parseInt(max_num,10))
				{
					t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
				}
			}else{
				t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
				
			}			
		}
		else
		{
		}
	}
	if(document.selection){
	t.focus()
	document.selection.createRange().text = txt;
	} else {
	var cp = selectStart; //t.selectionStart;
	var ubbLength = t.value.length;
	var s = t.scrollTop;
	//t.value = t.value.slice(0,t.selectionStart) + txt + t.value.slice(t.selectionStart, ubbLength);
	this.setCursorPosition(t,cp + txt.length);
	firefox=navigator.userAgent.toLowerCase().match(/firefox\/([\d\.]+)/) && setTimeout(function(){
	if(t.scrollTop != s) t.scrollTop=s;
	},0)
	};
	},
	
	/* 删除光标前面的 n 个字符 */
	del:function(t, n){
	var p = this.getCursorPosition(t);
	if(p>=n)
	{
		var s = t.scrollTop;
		var val = t.value;
		t.value = val.slice(0, p - n) + val.slice(p);
		this.setCursorPosition(t ,(p - n)<0?0:(p - n));
	}
	firefox=navigator.userAgent.toLowerCase().match(/firefox\/([\d\.]+)/) && setTimeout(function(){
	if(t.scrollTop != s) t.scrollTop=s;
	},10)
	},
	
	/* 选中 s 到 z 位置的文字 */
	sel:function(t, s, z){
	if(document.selection){
	var range = t.createTextRange();
	range.moveEnd('character', -t.value.length);
	range.moveEnd('character', z);
	range.moveStart('character', s);
	range.select();
	}else{
	t.setSelectionRange(s,z);
	t.focus();
	}
	t.scrollLeft = t.scrollWidth; //输入字数超出时，光标自动左移处理
	},
	
	/* 选中一个字符串	*/
	selString:function(t, s){
	var index = t.value.indexOf(s);
	index != -1 ? this.sel(t, index, index + s.length) : false;
	}
}
function letterToEmb(){
	if(langFlag==0)
	{	
		if(choice.innerHTML!="")//当中文状态并且未从字列表中选择字，而切换到英文键后的处理
		{
			TT.add(objInput,chInput.value);
			chInput.value="";
			choice.innerHTML="";
			choice.style.left=0+"px";
			choiceWrapper.style.display="none";		
		}
		document.getElementById('emb_1_1').value="！";
		document.getElementById('emb_1_9').value="（";
		document.getElementById('emb_1_10').value="）";
		document.getElementById('emb_1_11').value="—";
		
		document.getElementById('emb_2_2').value="·";
		document.getElementById('emb_2_10').value="、";
		document.getElementById('emb_2_11').value="？";	
		
		document.getElementById('emb_3_2').value="【";
		document.getElementById('emb_3_3').value="】";
		document.getElementById('emb_3_4').value="\‘";
		document.getElementById('emb_3_5').value="\’";
		document.getElementById('emb_3_6').value="\“";
		document.getElementById('emb_3_7').value="\”";
		document.getElementById('emb_3_9').value="：";
		document.getElementById('emb_3_10').value="；";
		document.getElementById('emb_3_11').value="，";
		document.getElementById('emb_3_12').value="。";
		
		document.getElementById('emb_4_7').value="《";
		document.getElementById('emb_4_8').value="》";	
	}
	else if(langFlag==1)
	{	 
		document.getElementById('emb_1_1').value="!";
		document.getElementById('emb_1_9').value="(";
		document.getElementById('emb_1_10').value=")";
		document.getElementById('emb_1_11').value="_";
		
		document.getElementById('emb_2_2').value="`";
		document.getElementById('emb_2_10').value="\\";
		document.getElementById('emb_2_11').value="?";	
		
		document.getElementById('emb_3_2').value="[";
		document.getElementById('emb_3_3').value="]";
		document.getElementById('emb_3_4').value="\＂";
		document.getElementById('emb_3_5').value="\＇";
		document.getElementById('emb_3_6').value="\"";
		document.getElementById('emb_3_7').value="\'";		
		document.getElementById('emb_3_9').value=":";
		document.getElementById('emb_3_10').value=";";
		document.getElementById('emb_3_11').value=",";
		document.getElementById('emb_3_12').value=".";		
		document.getElementById('emb_4_7').value="<";
		document.getElementById('emb_4_8').value=">";
	}
	document.getElementById('showKeyboard').style.display="none";
	document.getElementById('showEmbKey').style.display="block"; 
}
function embToLetter(){	
	 document.getElementById('showKeyboard').style.display="block";
	 document.getElementById('showEmbKey').style.display="none";	
}